
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

brew "awscli"
brew "azure-cli"
brew "bash"
brew "consul"
brew "doctl"
brew "fish"
brew "geckodriver"
brew "git"
brew "git-flow-avh"
brew "git-lfs"
brew "gnupg"
brew "goenv"
brew "helm"
brew "htop"
brew "jenv"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "nmap"
brew "node-build"
brew "nodenv"
brew "nomad"
brew "openssh" # TODO: fix installation errors
brew "perl-build"
brew "plenv"
brew "pyenv"
brew "rbenv"
brew "rename"
brew "ruby-build"
brew "rustup-init"
brew "terraform"
brew "unrar"
brew "vault"
brew "watch"
brew "watchman"
brew "zsh"

if OS.mac?
    tap "homebrew/cask"
    tap "homebrew/cask-drivers"
    tap "homebrew/cask-versions"
    tap "wix/brew"

    brew "wix/brew/applesimutils"
    brew "ios-deploy"
    brew "mas"

    cask "balenaetcher"
    cask "dash"
    cask "docker"
    cask "firefox"
    cask "gpg-suite"
    cask "hyper"
    cask "jetbrains-toolbox"
    cask "postman"
    cask "signal"
    cask "unity-hub"
    cask "visual-studio-code"

    mas "1Password 7", id: 1333542190
    mas "Bear", id: 1091189122
    mas "Friendly Streaming", id: 553245401
    mas "GarageBand", id: 682658836
    mas "iMovie", id: 408981434
    mas "Keynote", id: 409183694
    mas "Microsoft Excel", id: 462058435
    mas "Microsoft OneNote", id: 784801555
    mas "Microsoft PowerPoint", id: 462062816
    mas "Microsoft Remote Desktop", id: 1295203466
    mas "Microsoft To Do", id: 1274495053
    mas "Microsoft Word", id: 462054704
    mas "NordVPN IKE", id: 1116599239
    mas "Numbers", id: 409203825
    mas "OneDrive", id: 823766827
    mas "Pages", id: 409201541
    mas "Parallels Desktop", id: 1085114709
    mas "Rakuten Cash Back", id: 1451893560
    mas "Slack", id: 803453959
    mas "Termius", id: 1176074088
    mas "Xcode", id: 497799835
end
